package cn.threegiants.sprusermanager.comm.base;

/**
 * 统一返回码
 */
public enum ResponseEnum {

	// -----------系统公共 响应码 start------------//
	/**
	 * 0000 成功
	 */
	R_0000("0000", ""),

	/**
	 * 1001 系统异常，请稍后重试 <br>
	 * <desc>系统内部异常</desc>
	 */
	R_1001("1001", "系统异常，请稍后重试"),

	/**
	 * 1002 %s数据查询失败，请稍后重试
	 */
	R_1002("1002", "%s数据查询失败，请稍后重试"),

	/**
	 * 1003 订单系统升级，业务不能受理
	 */
	R_1003("1003", "订单系统升级，业务不能受理"),

	/**
	 * 1004 省份充值系统升级，业务不能受理
	 */
	R_1004("1004", "省份充值系统升级，业务不能受理"),

	/**
	 * 1005 其他错误
	 */
	R_1005("1005", "其他错误"),

	/**
	 * 1006 服务异常，请稍后重试 <br>
	 * <desc>调用第三方服务异常</desc>
	 */
	R_1006("1006", "服务异常，请稍后重试"),

	/**
	 * 2001 MD5签名校验错误
	 */
	R_2001("2001", "MD5签名校验错误"),

	/**
	 * 2002 请求报文错误
	 */
	R_2002("2002", "请求报文错误"),

	/**
	 * 2003 %s参数非法%s <br>
	 * <desc>%s 为自定文本内容，可以为空</desc>
	 */
	R_2003("2003", "%s参数非法%s"),

	/**
	 * 2004 %s手机号码不在号段范围内 <br>
	 * <desc>%s 为自定文本内容，可以为空</desc>
	 */
	R_2004("2004", "%s手机号码不在号段范围内"),

	/**
	 * 2005 该省份暂不支持流量充值业务
	 */
	R_2005("2005", "该省份暂不支持流量充值业务"),
	/**
	 * 2006 该手机号不在白名单内
	 */
	R_2006("2006", "该手机号不在白名单内"),
	/**
	 * S301 库存不存在
	 */
	R_1004_S301("S301", "库存不存在"),
	/**
	 * S302 活动暂未开始
	 */
	R_1004_S302("S302", "未到活动日"),
	/**
	 * S303 周期活动时间未开始
	 */
	R_1004_S303("S303", "活动将于%s点%s分开始"),
	/**
	 * S304 周期活动时间已结束
	 */
	R_1004_S304("S304", "今日活动已结束"),
	/**
	 * S305 活动已结束
	 */
	R_1004_S305("S305", "活动已结束"),

	/**
	 * O301 查询购买资格失败%s
	 */
	R_1007_O301("O301", "查询购买资格失败%s"),

	/**
	 * O302 %s （用户无资格购买）返回boss响应的原因
	 */
	R_1007_O302("O302", "%s"),

	/**
	 * O303 抱歉，活动商品已被抢空，商品已恢复原价，可继续原价购买
	 */
	R_1007_O303("O303", "抱歉，活动商品已被抢空，商品已恢复原价，可继续原价购买"),

	/**
	 * O304 创建订单失败
	 */
	R_1007_O304("O304", "创建订单失败"),

	/**
	 * O305 商品信息有误
	 */
	R_1007_O305("O305", "商品信息有误"),

	/**
	 * O306 无此订单信息
	 */
	R_1020_O306("O306", "无此订单信息"),

	/**
	 * O307 商品存在优惠，无法按原价提交
	 */
	R_1007_O307("O307", "商品存在优惠，无法按原价提交"),
	/**
	 * O308 互联网账号不能购买该商品 （备注：用户已登录）
	 */
	R_1007_O308("O308", "互联网账号不能购买该商品"),
	/**
	 * O309 仅限为登录号码充值 （备注：用户已登录）
	 */
	R_1007_O309("O309", "仅限为登录号码充值"),
	/**
	 * O3010 仅限手机号码登录并为本机充值 （备注：用户未登录）
	 */
	R_1007_O310("O310", "仅限手机号码登录并为本机充值"),
	/**
	 * O3011 仅限为登录购买 （备注：用户未登录）
	 */
	R_1007_O311("O311", "仅限登录购买"),
	/**
	 * O3013当前充值号已达到XX次参与上限，您可继续按照原价购买
	 */
	R_1007_O313("O313", "当前充值号已达到%s次参与上限，您可继续按照原价购买"),
	/**
	 * O3014您当前有活动订单未支付
	 */
	R_1007_O314("O314", "您当前有活动订单未支付"),
	/**
	 * O3015由于%s为%s充值的活动订单尚未支付
	 */
	R_1007_O315("O315", "由于%s为%s充值的活动订单尚未支付"),
	/**
	 * O3016当前充值号已达到XX次参与上限，您可看看其他活动
	 */
	R_1007_O316("O316", "当前充值号已达到%s次参与上限，您可看看其他活动"),
	/**
	 * O3017当前登录账号已达到%s次参与上限，您可继续按照原价购买
	 */
	R_1007_O317("O317", "当前登录账号已达到%s次参与上限，您可继续按照原价购买"),
	/**
	 * O3018当前登录账号已达到%s次参与上限，您可看看其他活动
	 */
	R_1007_O318("O318", "当前登录账号已达到%s次参与上限，您可看看其他活动"),
	/**
	 * O3019已到达该商品下所有活动的参与次数上限，您可继续原价购买
	 */
	R_1007_O319("O319", "已到达该商品下所有活动的参与次数上限，您可继续原价购买"),
	/**
	 * O3020抢购过于火爆 黑名单IP
	 */
	R_1007_O320("O320", "抢购过于火爆"),
	/**
	 * O3021抱歉，该活动商品仅限特定用户享用 黑白名单限制
	 */
	R_1007_O321("O321", "抱歉，该活动商品仅限特定用户享用"),

	// -----------订单创建 响应码 end------------//

	// -----------推荐人 响应吗 start------------//
	/**
	 * O701 无推荐人号码
	 */
	R_1023_O701("O701", "无推荐人号码"),

	/**
	 * O702 推荐人信息记录失败
	 */
	R_1023_O702("O702", "推荐人信息记录失败"),
	/**
	 * T101 订单不可支付%s
	 * 
	 */
	R_1008_T101("T101", "订单不可支付%s"),

	/**
	 * T102 支付请求失败
	 */
	R_1008_T102("T102", "支付请求失败"),

	/**
	 * T103 订单无效%s
	 */
	R_1008_T103("T103", "订单无效%s"),
	/**
	 * O401 活动不存在
	 */
	R_1018_O401("O401", "活动不存在"),

	/**
	 * O401 活动不在有效期内
	 */
	R_1018_O402("O402", "活动不在有效期内"),

	/**
	 * O401 流量赠送商品库存不足
	 */
	R_1018_O403("O403", "流量赠送商品库存不足"),

	/**
	 * O404 充值失败%s
	 */
	R_1018_O404("O404", "充值失败%s"),

	/**
	 * O405 被赠送号码到达赠送上限
	 */
	R_1018_O405("O405", "被赠送号码到达赠送上限"),

	/**
	 * O406 流量直充接口超时
	 */
	R_1018_O406("O406", "流量直充接口超时"),

	// -----------订单支付 响应码 end------------//

	// -----------积分支付 响应码 start------------//
	/**
	 * T501 积分支付失败
	 */
	R_1013_T501("T501", "积分支付失败"),
	// -----------积分支付 响应码 end------------//

	// -----------积分查询 响应码 start------------//
	/**
	 * T601 积分查询失败
	 */
	R_1012_T601("T601", "积分查询失败"),
	// -----------积分查询 响应码 end------------//
	/**
	 * 卡卷资格校验失败
	 */
	R_K001("K001", "卡卷资格校验失败"),

	/**
	 * 卡券返销失败
	 */
	R_K002("K002", "卡卷返销失败%s"),

	/**
	 * 抱歉，卡卷使用/锁定/校验失败
	 */
	R_K003("K003", "抱歉，%s"),

	/**
	 * 已存在卡卷订单
	 */
	R_K004("K004", "抱歉，优惠券不可重复使用，请关注流量到账情况"),

	/**
	 * 查询卡卷列表失败
	 */
	R_K005("K005", "查询卡卷列表失败"),

	/**
	 * 该优惠券仅限给登录手机号充值
	 */
	R_K006("K006", "该优惠券仅限给登录手机号充值"),

	/**
	 * 该优惠券仅限%s渠道使用
	 */
	R_K007("K007", "该优惠券仅限%s渠道使用"),
	/**
	 * 该卡券已经存在1笔待支付订单，您可前往订单列表完成支付，或1小时候卡券自动释放，有效期内可重新使用
	 */
	R_K008("K008", "该卡券已经存在1笔待支付订单，您可前往订单列表完成支付，或1小时候卡券自动释放，有效期内可重新使用"),

	// 优惠登录属性信息
	R_1026_S401("S401", "优惠不存在");

	private String code;
	private String desc;

	ResponseEnum(String code, String desc) {
		this.code = code;
		this.desc = desc;
	}

	public String getCode() {
		return code;
	}

	public String getDesc(String... args) {
		final int ftLen = getFormatSize(desc);
		if (ftLen <= 0) {
			return desc;
		}
		String[] s = new String[ftLen];

		if (args.length != ftLen) {
			s = new String[ftLen];
		}

		for (int i = 0; i < s.length; i++) {
			if ((i + 1) > args.length) {
				s[i] = "";
				continue;
			}
			if (null == args[i]) {
				s[i] = "";
			} else {
				s[i] = args[i];
			}
		}
		return String.format(desc, s);
	}

	private static int getFormatSize(String str) {
		int i = 0;
		if (str.indexOf("%s") > -1) {
			i++;
			i += getFormatSize(str.substring(str.indexOf("%s") + 2, str.length()));
			return i;
		} else {
			return i;
		}
	}

	public static void main(String[] args) {
		System.out.println(ResponseEnum.R_2004.getDesc());
		System.out.println(ResponseEnum.R_2004.getDesc("aa"));
		for (ResponseEnum day:ResponseEnum.values()) {
			System.out.println("name:"+day.name()+
					",code:"+day.getCode()+",desc:"+day.getDesc());
		}
	}

}
